user-4.1/tutorials/multiPhysics/interTrackEddyCurrentFoam/rgsSimpleBlock3D/constant/region_fluid/trackedSurfaceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      trackedSurfaceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

twoFluids                                    no;

cleanInterface                               yes;

noCleanTangentialSurfaceTensionCorrection    yes;

normalMotionDir                              no;
motionDir                                    (0 0 1);

fixedTrackedSurfacePatches                   0();

pointNormalsCorrectionPatches                1(sideWall); // no contactAngle given
// pointNormalsCorrectionPatches                0(); // contactAngle given

nTrackedSurfaceCorrectors                    1;

interfaceDeformationLimit                    0.2;

total0Update                                 yes;

useSubMesh                                   yes;

correctVolume                                yes;

// resetControlPoints                           yes;

// smoothing                                    yes;

// freeContactAngle                             yes;

// correctPointNormals                          yes;
// correctDisplacement                          yes;
// correctCurvature                             yes;
//
// fvcNGradUn                                   yes;

// ************************************************************************* //
