user-4.1/tutorials/multiPhysics/interTrackEddyCurrentFoam/rgsSimpleBlock3D/Allrun.geometry
#!/bin/bash

# Remove old featureEdgeMesh
rm -rf constant/triSurface

# Create geometry
./setup/geometry.py || exit 1

# Create setSetBatch
./setup/setSetBatch.py || exit 1
